<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5ef19e0ed954c976841e688aa9ff4b44de712574b64b5eb45e8e034368a0d3a2","plan_job_ref":"Job continuous-integration/commit-to-pull-request #32 at https://github.com/sudoblark/sudoblark.terraform.modularised-demo/actions/runs/14090163692","plan_out_hash":"78b72c272289bbc21b228cb8a0c6acdd77554973ab4ef1370bdcb098aaefa8a8","plan_hash":"26aee38ca59e206b179ce8f973b1f4622fa3275a25ce2c4cb1ac8a0378c892d3","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __./infrastructure/sudoblark__
<details>
<summary>Plan: 3 to add, 5 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda.data.aws_kms_key.known_keys["processed"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_kms_key" "known_keys" {
+       arn                             = (known after apply)
+       aws_account_id                  = (known after apply)
+       cloud_hsm_cluster_id            = (known after apply)
+       creation_date                   = (known after apply)
+       custom_key_store_id             = (known after apply)
+       customer_master_key_spec        = (known after apply)
+       deletion_date                   = (known after apply)
+       description                     = (known after apply)
+       enabled                         = (known after apply)
+       expiration_model                = (known after apply)
+       id                              = (known after apply)
+       key_id                          = "************************"
+       key_manager                     = (known after apply)
+       key_spec                        = (known after apply)
+       key_state                       = (known after apply)
+       key_usage                       = (known after apply)
+       multi_region                    = (known after apply)
+       multi_region_configuration      = (known after apply)
+       origin                          = (known after apply)
+       pending_deletion_window_in_days = (known after apply)
+       valid_to                        = (known after apply)
+       xks_key_configuration           = (known after apply)
    }

  # module.lambda.data.aws_kms_key.known_keys["raw"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_kms_key" "known_keys" {
+       arn                             = (known after apply)
+       aws_account_id                  = (known after apply)
+       cloud_hsm_cluster_id            = (known after apply)
+       creation_date                   = (known after apply)
+       custom_key_store_id             = (known after apply)
+       customer_master_key_spec        = (known after apply)
+       deletion_date                   = (known after apply)
+       description                     = (known after apply)
+       enabled                         = (known after apply)
+       expiration_model                = (known after apply)
+       id                              = (known after apply)
+       key_id                          = "******************"
+       key_manager                     = (known after apply)
+       key_spec                        = (known after apply)
+       key_state                       = (known after apply)
+       key_usage                       = (known after apply)
+       multi_region                    = (known after apply)
+       multi_region_configuration      = (known after apply)
+       origin                          = (known after apply)
+       pending_deletion_window_in_days = (known after apply)
+       valid_to                        = (known after apply)
+       xks_key_configuration           = (known after apply)
    }

  # module.lambda.data.aws_sns_topic.known_topics["etl-failure"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_sns_topic" "known_topics" {
+       arn  = (known after apply)
+       id   = (known after apply)
+       name = "aws-dev-demo-etl-failure"
+       tags = (known after apply)
    }

  # module.s3_bucket_notifications.data.aws_lambda_function.known_lambdas["unzip"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_function" "known_lambdas" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       code_sha256                    = (known after apply)
+       code_signing_config_arn        = (known after apply)
+       dead_letter_config             = (known after apply)
+       description                    = (known after apply)
+       environment                    = (known after apply)
+       ephemeral_storage              = (known after apply)
+       file_system_config             = (known after apply)
+       function_name                  = "aws-dev-demo-unzip-lambda"
+       handler                        = (known after apply)
+       id                             = (known after apply)
+       image_uri                      = (known after apply)
+       invoke_arn                     = (known after apply)
+       kms_key_arn                    = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = (known after apply)
+       logging_config                 = (known after apply)
+       memory_size                    = (known after apply)
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = (known after apply)
+       role                           = (known after apply)
+       runtime                        = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags                           = (known after apply)
+       timeout                        = (known after apply)
+       tracing_config                 = (known after apply)
+       version                        = (known after apply)
+       vpc_config                     = (known after apply)
    }

  # module.lambda.module.lambda.data.aws_caller_identity.current_account will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current_account" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.lambda.module.lambda.data.aws_iam_policy_document.attached_policies["unzip"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "attached_policies" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "s3:ListBucket",
            ]
+           resources = [
+               "arn:aws:s3:::dev-demo-processed",
+               "arn:aws:s3:::dev-demo-raw",
            ]
+           sid       = "ListS3Buckets"
        }
+       statement {
+           actions   = [
+               "s3:GetObject",
            ]
+           resources = [
+               "arn:aws:s3:::dev-demo-raw/*",
            ]
+           sid       = "GetS3Objects"
        }
+       statement {
+           actions   = [
+               "s3:PutObject",
            ]
+           resources = [
+               "arn:aws:s3:::dev-demo-processed/*",
            ]
+           sid       = "PutS3Objects"
        }
+       statement {
+           actions   = [
+               "kms:Decrypt",
+               "kms:GenerateDataKey",
            ]
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "AllowKMSDecryptForS3"
        }
+       statement {
+           actions   = [
+               "sns:Publish",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowPublishToSNS"
        }
+       statement {
+           actions   = [
+               "ec2:AttachNetworkInterface",
+               "ec2:CreateNetworkInterface",
+               "ec2:DeleteNetworkInterface",
+               "ec2:DescribeInstances",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "RequiredEC2BasicPermissions"
        }
+       statement {
+           actions   = [
+               "ec2:DescribeNetworkInterfaces",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "RequiredEC2NetworkInterfacePermissions"
        }
    }

  # module.lambda.module.lambda.data.aws_region.current_region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current_region" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.s3_bucket_notifications.module.s3_bucket_notifications.data.aws_s3_bucket.s3_buckets["dev-demo-raw"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "s3_buckets" {
+       arn                         = (known after apply)
+       bucket                      = "dev-demo-raw"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3_bucket_notifications.module.s3_bucket_notifications.aws_lambda_permission.allow_lambda_execution_from_bucket["dev-demo-raw/aws-dev-demo-unzip-lambda"] must be replaced
-/+ resource "aws_lambda_permission" "allow_lambda_execution_from_bucket" {
!~      id                  = "**************************" -> (known after apply)
!~      source_arn          = "arn:aws:s3:::dev-demo-raw" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
#        (4 unchanged attributes hidden)
    }

  # module.s3_bucket_notifications.module.s3_bucket_notifications.aws_s3_bucket_notification.bucket_notification["dev-demo-raw"] must be replaced
-/+ resource "aws_s3_bucket_notification" "bucket_notification" {
!~      bucket      = "dev-demo-raw" # forces replacement -> (known after apply) # forces replacement
!~      id          = "************" -> (known after apply)
#        (1 unchanged attribute hidden)

!~      lambda_function {
!~          id                  = "***************************************" -> (known after apply)
!~          lambda_function_arn = "arn:aws:lambda:eu-west-2:741139166799:function:aws-dev-demo-unzip-lambda" -> (known after apply)
#            (3 unchanged attributes hidden)
        }
    }

  # module.s3_files.module.s3_files.aws_s3_object.uploaded_files["config"] will be updated in-place
!~  resource "aws_s3_object" "uploaded_files" {
!~      etag                   = "7cbeaca48d340eb786f212b0a4f2bb3e" -> "0742dc1d5f0eb68c1cc8ce4401db4d4c"
        id                     = "config/unzip.json"
        tags                   = {}
!~      version_id             = "********************************" -> (known after apply)
#        (11 unchanged attributes hidden)
    }

  # module.sns.module.sns.aws_sns_topic_subscription.subscriptions["etl-failure/enquires_alert"] will be created
+   resource "aws_sns_topic_subscription" "subscriptions" {
+       arn                             = (known after apply)
+       confirmation_timeout_in_minutes = 1
+       confirmation_was_authenticated  = (known after apply)
+       endpoint                        = "enquires@sudoblark.com"
+       endpoint_auto_confirms          = false
+       filter_policy_scope             = (known after apply)
+       id                              = (known after apply)
+       owner_id                        = (known after apply)
+       pending_confirmation            = (known after apply)
+       protocol                        = "email"
+       raw_message_delivery            = false
+       topic_arn                       = "arn:aws:sns:eu-west-2:741139166799:aws-dev-demo-etl-failure"
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "lambda.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.data.aws_iam_policy_document.logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "logs" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:eu-west-2:741139166799:log-group:/aws/lambda/aws-dev-demo-unzip-lambda:*",
+               "arn:aws:logs:eu-west-2:741139166799:log-group:/aws/lambda/aws-dev-demo-unzip-lambda:*:*",
            ]
        }
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_iam_policy.additional_json[0] will be updated in-place
!~  resource "aws_iam_policy" "additional_json" {
        id               = "arn:aws:iam::741139166799:policy/aws-dev-demo-unzip-lambda"
        name             = "aws-dev-demo-unzip-lambda"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "s3:ListBucket"
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::dev-demo-raw",
-                           "arn:aws:s3:::dev-demo-processed",
                        ]
-                       Sid      = "ListS3Buckets"
                    },
-                   {
-                       Action   = "s3:GetObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::dev-demo-raw/*"
-                       Sid      = "GetS3Objects"
                    },
-                   {
-                       Action   = "s3:PutObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::dev-demo-processed/*"
-                       Sid      = "PutS3Objects"
                    },
-                   {
-                       Action   = [
-                           "kms:GenerateDataKey",
-                           "kms:Decrypt",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:kms:eu-west-2:741139166799:key/c655d2fe-6fd0-443f-a45b-641c8df1a015",
-                           "arn:aws:kms:eu-west-2:741139166799:key/1ac89bd7-c061-4f9d-a660-f213a69ba29b",
                        ]
-                       Sid      = "AllowKMSDecryptForS3"
                    },
-                   {
-                       Action   = "sns:Publish"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:sns:eu-west-2:741139166799:aws-dev-demo-etl-failure"
-                       Sid      = "AllowPublishToSNS"
                    },
-                   {
-                       Action   = [
-                           "ec2:DescribeInstances",
-                           "ec2:DeleteNetworkInterface",
-                           "ec2:CreateNetworkInterface",
-                           "ec2:AttachNetworkInterface",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:ec2:eu-west-2:741139166799:*"
-                       Sid      = "RequiredEC2BasicPermissions"
                    },
-                   {
-                       Action   = "ec2:DescribeNetworkInterfaces"
-                       Effect   = "Allow"
-                       Resource = "*"
-                       Sid      = "RequiredEC2NetworkInterfacePermissions"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "aws-dev-demo-unzip-lambda"
        }
#        (5 unchanged attributes hidden)
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_iam_policy.logs[0] will be updated in-place
!~  resource "aws_iam_policy" "logs" {
        id               = "arn:aws:iam::741139166799:policy/aws-dev-demo-unzip-lambda-logs"
        name             = "aws-dev-demo-unzip-lambda-logs"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:eu-west-2:741139166799:log-group:/aws/lambda/aws-dev-demo-unzip-lambda:*:*",
-                           "arn:aws:logs:eu-west-2:741139166799:log-group:/aws/lambda/aws-dev-demo-unzip-lambda:*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "aws-dev-demo-unzip-lambda"
        }
#        (5 unchanged attributes hidden)
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_iam_role.lambda[0] will be updated in-place
!~  resource "aws_iam_role" "lambda" {
!~      assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "aws-dev-demo-unzip-lambda"
        name                  = "aws-dev-demo-unzip-lambda"
        tags                  = {
            "Name" = "aws-dev-demo-unzip-lambda"
        }
#        (8 unchanged attributes hidden)
    }

  # module.lambda.module.lambda.module.lambdas["unzip"].module.lambda.aws_lambda_function.this[0] will be updated in-place
!~  resource "aws_lambda_function" "this" {
        id                             = "aws-dev-demo-unzip-lambda"
        tags                           = {
            "Name" = "aws-dev-demo-unzip-lambda"
        }
#        (24 unchanged attributes hidden)

!~      environment {
!~          variables = {
-               "ERROR_SNS_TOPIC"    = "arn:aws:sns:eu-west-2:741139166799:aws-dev-demo-etl-failure"
-               "LOG_LEVEL"          = "INFO"
-               "TARGET_BUCKET_NAME" = "dev-demo-processed"
-               "TARGET_PREFIX"      = "dogs/daily"
            } -> (known after apply)
        }

-       logging_config {
-           log_format = "Text" -> null
-           log_group  = "/aws/lambda/aws-dev-demo-unzip-lambda" -> null
        }

#        (2 unchanged blocks hidden)
    }

Plan: 3 to add, 5 to change, 2 to destroy.

Warning: Invalid Attribute Combination

  with module.s3_bucket.module.s3_bucket.module.s3_bucket.aws_s3_bucket_lifecycle_configuration.lifecycle_rule,
  on /tmp/terraform-data-dir/modules/s3_bucket.s3_bucket/modules/s3_bucket/lifecycle_configuration.tf line 4, in resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_rule":
   4:   rule {

No attribute specified when one (and only one) of [rule[0].prefix.<.filter]
is required

This will be an error in a future version of the provider

(and 9 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [continuous-integration/commit-to-pull-request #32](https://github.com/sudoblark/sudoblark.terraform.modularised-demo/actions/runs/14090163692)